#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.zerorg: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG]
azurerm_app_service_plan.zerosp: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/serverfarms/GitHubActionsalexSP]
azurerm_application_insights.heroesappinsights: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/microsoft.insights/components/HeroesalexInsights]
azurerm_sql_server.sqlsrv: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Sql/servers/heroessqlfake]
azurerm_sql_firewall_rule.sqlsrvfirewall: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Sql/servers/heroessqlfake/firewallRules/sqlfr1]
azurerm_sql_database.heroesdatabase: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Sql/servers/heroessqlfake/databases/heroesdatabasefake]
azurerm_app_service.heroesweb: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/sites/heroesweb-fake]
azurerm_app_service.heroesapi: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/sites/heroesapi-fake]
azurerm_app_service_slot.heroesapislot: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/sites/heroesapi-fake/slots/blue]
azurerm_app_service_slot.heroeswebslot: Refreshing state... [id=/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/sites/heroesweb-fake/slots/blue]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_app_service.heroesapi will be updated in-place
  ~ resource "azurerm_app_service" "heroesapi" {
      ~ app_settings                      = {
          + "Cors__0"                                = "https://heroesweb.azurewebsites.net"
            # (2 unchanged elements hidden)
        }
        id                                = "/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/sites/heroesapi-fake"
        name                              = "heroesapi-fake"
        tags                              = {}
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # azurerm_app_service_slot.heroesapislot will be updated in-place
  ~ resource "azurerm_app_service_slot" "heroesapislot" {
      ~ app_settings            = {
          + "Cors__0"                                = "https://heroesweb.azurewebsites.net"
            # (2 unchanged elements hidden)
        }
        id                      = "/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/sites/heroesapi-fake/slots/blue"
        name                    = "blue"
        tags                    = {}
        # (9 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # azurerm_app_service_slot.heroesapislotperf will be created
  + resource "azurerm_app_service_slot" "heroesapislotperf" {
      + app_service_name        = "heroesapi-fake"
      + app_service_plan_id     = "/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Web/serverfarms/GitHubActionsalexSP"
      + app_settings            = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"         = "ec79c42c-59fa-406f-86ea-71e423b83474"
          + "ApplicationInsights:InstrumentationKey" = "ec79c42c-59fa-406f-86ea-71e423b83474"
          + "Cors__0"                                = "https://heroesweb.azurewebsites.net"
        }
      + client_affinity_enabled = (known after apply)
      + default_site_hostname   = (known after apply)
      + enabled                 = true
      + https_only              = false
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "performance"
      + resource_group_name     = "GitHubActionsRG"
      + site_credential         = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + always_on                   = true
          + dotnet_framework_version    = "v4.0"
          + ftps_state                  = (known after apply)
          + http2_enabled               = false
          + ip_restriction              = (known after apply)
          + linux_fx_version            = (known after apply)
          + local_mysql_enabled         = (known after apply)
          + managed_pipeline_mode       = "Integrated"
          + min_tls_version             = (known after apply)
          + number_of_workers           = (known after apply)
          + remote_debugging_enabled    = false
          + remote_debugging_version    = (known after apply)
          + scm_ip_restriction          = (known after apply)
          + scm_type                    = (known after apply)
          + scm_use_main_ip_restriction = false
          + websockets_enabled          = true
          + windows_fx_version          = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }
    }

  # azurerm_sql_firewall_rule.sqlsrvfirewall will be updated in-place
  ~ resource "azurerm_sql_firewall_rule" "sqlsrvfirewall" {
        id                  = "/subscriptions/6b3454c3-f2da-4e87-ac07-9ff45cdc5326/resourceGroups/GitHubActionsRG/providers/Microsoft.Sql/servers/heroessqlfake/firewallRules/sqlfr1"
        name                = "sqlfr1"
      ~ start_ip_address    = "1.1.1.1" -> "1.2.1.1"
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```
</details>
*Pusher: @snavarropino, Action: `pull_request`*